with open('2.txt', 'w', encoding='utf-8') as file:
    file.write('2.txt\n')
    file.write('1\n')
    file.writelines('Тревога началась в тринадцать часов ноль две минуты.\n')
    file.write('3.txt\n')
    file.write('6\n')
    file.writelines('''В  это время  дня  машины текли сплошным  блестящим  потоком,  а  среди потока, будто  колонны 
    из бетона  и стекла, высились  здания. Здесь,  в мире резких граней,  люди  на тротуарах  выглядели  несчастными 
    и  неприкаянными. Одеты они были хорошо, но как-то удивительно походили друг на друга и все до одного спешили. 
    Они шли нестройными  вереницами, широко разливались, завидев красный  светофор или  металлический  блеск 
    кафе-автоматов.  Они непрестанно озирались по сторонам и теребили портфели и сумочки.Полицейские  машины  с  
    включенными  сиренами  пробивались  сквозь  эту толчею.\n''')
    file.write('1.txt\n')
    file.write('5\n')
    file.writelines('''Начальник  полиции лично позвонил в шестнадцатый участок.
    А спустя  одну минуту тридцать секунд в дежурке и других комнатах нижнего этажа раздались звонки. Когда Иенсен
    --  комиссар  шестнадцатого  участка --  вышел  из своего кабинета,  звонки еще  не смолкли. Иенсен был мужчина
    средних лет,  обычного сложения, с лицом плоским и невыразительным. На последней ступеньке винтовой лестницы  он
    задержался  и  обвел взглядом помещение дежурки. Затем поправил галстук и проследовал к машине.\n''')
